yt11dev.СК/src/DataProcessors/СК_МобСклад/СК_МобСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_МобСклад</name>
</mdclass:DataProcessor>

yt11dev.СК/src/InformationRegisters/СК_Инвентаризация/СК_Инвентаризация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СК_Инвентаризация</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПересчета</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/InformationRegisters/СК_БлокировкаСекций/СК_БлокировкаСекций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СК_БлокировкаСекций</name>
  <resources>
    <name>Блокировка</name>
    <type>
      <types>EnumRef.СК_СтатусыБлокировокСекций</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументПересчета</name>
    <type>
      <types>DocumentRef.ПересчетТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Секция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/AccumulationRegisters/СК_ТоварыНаСкладах/СК_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СК_ТоварыНаСкладах</name>
  <resources>
    <name>Вналичии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

yt11dev.СК/src/Enums/ВидыДвиженияНакопления/ВидыДвиженияНакопления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="620f4fb1-f265-408c-a5dc-7f66421e133b">
  <name>ВидыДвиженияНакопления</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f0e7f236-529a-4492-b4b5-c6b0366e5eac">
    <name>Приход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="654dd705-8d30-4aca-8566-2942ac5e614b">
    <name>Расход</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

yt11dev.СК/src/DataProcessors/СК_МобСклад/Forms/ФормаИнвентаризацииСекции/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СтруктураПараметров = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	ДокументПересчета = СтруктураПараметров.ДокументПересчета;	
	Секция = СтруктураПараметров.Секция;
	Элементы.ДекорацияСекции.Заголовок = "Секция " + Строка(СтруктураПараметров.Секция);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	Если ПроверитьСтатусСекция() Тогда
		
		Ответ = Вопрос("Заблокировать ячейку?",
		РежимДиалогаВопрос.ДаНет,
		0, // таймаут в секундах
		КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
		"Заблокировать ячейку" // (необ.) заголовок
		//"По данному ордеру все собрано !!!"
		);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ЗаблокироватьСекцию();
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьТовары();
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьТовары()
	Товары.Очистить();  

	ТекПользователь = Пользователи.АвторизованныйПользователь().Ссылка;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	               |	СК_Инвентаризация.Количество КАК Количество,
	               |	СК_Инвентаризация.Ячейка КАК Ячейка
	               |ИЗ
	               |	РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	               |ГДЕ
	               |	СК_Инвентаризация.ДокументПересчета = &ДокументПересчета
	               |	И СК_Инвентаризация.Пользователь = &Пользователь
	               |	И СК_Инвентаризация.Ячейка.Секция = &Секция"; 
	Запрос.УстановитьПараметр("ДокументПересчета",ДокументПересчета);
	Запрос.УстановитьПараметр("Пользователь",ТекПользователь);
	Запрос.УстановитьПараметр("Секция",Секция);
	Рез = Запрос.Выполнить().Выгрузить();
	Товары.Загрузить(Рез);
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьСекцию()
	НаборЗаписей = РегистрыСведений.СК_БлокировкаСекций.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.ДокументПересчета.Установить(ДокументПересчета);
	НаборЗаписей.Отбор.Секция.Установить(Секция);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 1 Тогда
		НЗапись = НаборЗаписей[0];
		НЗапись.Блокировка = Перечисления.СК_СтатусыБлокировокСекций.Заблокировано;
	КонецЕсли;
	НаборЗаписей.Записать();
	
КонецПроцедуры


//1 - Заблокировано
//2 - Расчет
//3 - Завершено ИЛИ Передано 
//1 - Заблокировано
&НаСервере
Функция ПроверитьСтатусСекция()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_БлокировкаСекций.Блокировка КАК Блокировка
	|ИЗ
	|	РегистрСведений.СК_БлокировкаСекций КАК СК_БлокировкаСекций
	|ГДЕ
	|	СК_БлокировкаСекций.ДокументПересчета = &ДокументПересчета
	|	И СК_БлокировкаСекций.Секция = &Секция
	|	И СК_БлокировкаСекций.Блокировка = ЗНАЧЕНИЕ(Перечисление.СК_СтатусыБлокировокСекций.Расчет) 
	|	"; 
	Запрос.УстановитьПараметр("ДокументПересчета",ДокументПересчета);
	Запрос.УстановитьПараметр("Секция",Секция); 
	
	Рез = Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Добавить(Команда)
	
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Ячейка","");
	ПараметрыФормыОстатки.Вставить("Секция",Секция);
	ПараметрыФормыОстатки.Вставить("ДокументПересчета",ДокументПересчета);
	ПараметрыФормыОстатки.Вставить("Номенклатура","");
	
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СК_МобСклад.Форма.ФормаИнвентаризацииЯчейки", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	ЗавершитьПересчетСекции();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗавершитьПересчетСекции()
	НаборЗаписей = РегистрыСведений.СК_БлокировкаСекций.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.ДокументПересчета.Установить(ДокументПересчета);
	НаборЗаписей.Отбор.Секция.Установить(Секция);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 1 Тогда
		НЗапись = НаборЗаписей[0];
		НЗапись.Блокировка = Перечисления.СК_СтатусыБлокировокСекций.Завершено; 
		НаборЗаписей.Записать();
		СоздатьДокументКорректировки(Секция);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументКорректировки(Секция) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	СК_ТоварыНаСкладахОстатки.ВналичииОстаток КАК ВналичииОстаток
	|ПОМЕСТИТЬ ВТЗОстатки
	|ИЗ
	|	РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СК_Инвентаризация.Номенклатура КАК Номенклатура,
	|	СК_Инвентаризация.Ячейка КАК Ячейка,
	|	СК_Инвентаризация.Количество КАК Количество,
	|	СУММА(ВЫБОР
	|			КОГДА СК_Инвентаризация.Номенклатура = ВТЗОстатки.Номенклатура
	|					И СК_Инвентаризация.Ячейка = ВТЗОстатки.Ячейка
	|				ТОГДА ВТЗОстатки.ВналичииОстаток
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК КоличествоИстория
	|ПОМЕСТИТЬ ВТЗИнвентаризация		
	|ИЗ
	|	РегистрСведений.СК_Инвентаризация КАК СК_Инвентаризация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗОстатки КАК ВТЗОстатки
	|		ПО (СК_Инвентаризация.Номенклатура = ВТЗОстатки.Номенклатура)
	|ГДЕ
	|	СК_Инвентаризация.Ячейка.Секция = &Секция
	|	И СК_Инвентаризация.ДокументПересчета = &ДокументПересчета
	|
	|СГРУППИРОВАТЬ ПО
	|	СК_Инвентаризация.Номенклатура,
	|	СК_Инвентаризация.Ячейка,
	|	СК_Инвентаризация.Количество;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТЗИнвентаризация.Номенклатура КАК Номенклатура,
	|	ВТЗИнвентаризация.Ячейка КАК Ячейка,
	|	ВТЗИнвентаризация.Количество - ВТЗИнвентаризация.КоличествоИстория КАК Количество,
	|	ВТЗИнвентаризация.КоличествоИстория КАК КоличествоИстория,
	|	ВЫБОР
	|		КОГДА ВТЗИнвентаризация.Количество - ВТЗИнвентаризация.КоличествоИстория > 0
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Приход)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженияНакопления.Расход)
	|	КОНЕЦ КАК ВидДвижения,
	|	&Время КАК Время
	|ИЗ
	|	ВТЗИнвентаризация КАК ВТЗИнвентаризация";
	Запрос.УстановитьПараметр("ДокументПересчета",ДокументПересчета);
	Запрос.УстановитьПараметр("Секция",Секция);
	Запрос.УстановитьПараметр("Время",ТекущаяДата());
	
	Рез = Запрос.Выполнить().Выгрузить();
	
	Док = Документы.СК_Корректировка.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.Товары.Загрузить(Рез);
	Док.Записать(РежимЗаписиДокумента.Проведение);
	

	
	
КонецПроцедуры


&НаКлиенте
Процедура ЗакрытьИнвСекции(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 
	ПараметрыФормыОстатки = Новый Структура;
	ПараметрыФормыОстатки.Вставить("Ячейка",Элемент.ТекущиеДанные.Ячейка);
	ПараметрыФормыОстатки.Вставить("Секция",Секция);
	ПараметрыФормыОстатки.Вставить("ДокументПересчета",ДокументПересчета);
	ПараметрыФормыОстатки.Вставить("Номенклатура",Элемент.ТекущиеДанные.Номенклатура);
	
	АдресПередаваемыхПараметров = ПоместитьВоВременноеХранилище(ПараметрыФормыОстатки,Новый УникальныйИдентификатор);
	_Параметры = новый Структура("Адрес", АдресПередаваемыхПараметров);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗакрытиеФормыНовыйЗаказ", ЭтаФорма);
	ОткрытьФорму("Обработка.СК_МобСклад.Форма.ФормаИнвентаризацииЯчейки", _Параметры,ЭтаФорма, , , , ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьЗакрытиеФормыНовыйЗаказ(Значение, ДопПараметры) Экспорт
	ЗаполнитьТовары();		
КонецПроцедуры
